apache/nuttx/arch/arm/src/common/stm32/stm32_fdcan_m0_v1_sock.c
  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  fdcan_dumptxregs(priv, "Before send");

  /* That that FIFO elements were configured */

  DEBUGASSERT(config->ntxfifoq > 0);

  /* Get our reserved Tx FIFO/queue put index */

  regval = fdcan_getreg(priv, STM32_FDCAN_TXFQS_OFFSET);
  DEBUGASSERT((regval & FDCAN_TXFQS_TFQF) == 0);

  ndx = (regval & FDCAN_TXFQS_TFQPI_MASK) >> FDCAN_TXFQS_TFQPI_SHIFT;

  /* And the TX buffer corresponding to this index */

  txbuffer = (config->msgram.txfifoq + ndx * config->txbufferesize);

  /* Format the TX FIFOQ entry
   *
   * Format word T0:
   *   Transfer message ID (ID)          - Value from message structure
   *   Remote Transmission Request (RTR) - Value from message structure
   *   Extended Identifier (XTD)         - Depends on configuration.
   *   Error state indicator (ESI)       - ESI bit in CAN FD
   *
   * Format word T1:
   *   Data Length Code (DLC)            - Value from message structure
   *   Bit Rate Switch (BRS)             - Bit rate switching for CAN FD
   *   FD format (FDF)                   - Frame transmitted in CAN FD format
   *   Event FIFO Control (EFC)          - Do not store events.
   *   Message Marker (MM)               - Always zero
   */

  txbuffer[0] = 0;
  txbuffer[1] = 0;

  /* CAN 2.0 or CAN FD */

  if (priv->dev.d_len == sizeof(struct can_frame))
    {
      struct can_frame *frame = NULL;

      frame = (struct can_frame *)priv->dev.d_buf;

      ninfo("CAN%" PRIu8 " 2.0 ID: %" PRIu32 " DLC: %" PRIu8 "\n",
            config->port, (uint32_t)frame->can_id, frame->can_dlc);

      /* Extended or standard ID */

#ifdef CONFIG_NET_CAN_EXTID
      if ((frame->can_id & CAN_EFF_FLAG) != 0)
        {
          DEBUGASSERT((frame->can_id ^ CAN_EFF_FLAG) < (1 << 29));

          txbuffer[0] |= BUFFER_R0_EXTID(frame->can_id) | BUFFER_R0_XTD;
        }
      else
#endif
        {
          DEBUGASSERT(frame->can_id < (1 << 11));

          txbuffer[0] |= BUFFER_R0_STDID(frame->can_id);
        }

      /* Set DLC */

      txbuffer[1] |= BUFFER_R1_DLC(frame->can_dlc);

      /* Set flags */

      if ((frame->can_id & CAN_RTR_FLAG) != 0)
        {
          txbuffer[0] |= BUFFER_R0_RTR;
        }

      /* Reset CAN FD bits */

      txbuffer[0] &= ~BUFFER_R0_ESI;
      txbuffer[1] &= ~BUFFER_R1_FDF;
      txbuffer[1] &= ~BUFFER_R1_BRS;

      /* Followed by the amount of data corresponding to the DLC (T2..) */

      src    = frame->data;
      nbytes = frame->can_dlc;
    }
#ifdef CONFIG_NET_CAN_CANFD
  else /* CAN FD frame */
    {
      struct canfd_frame *frame = (struct canfd_frame *)priv->dev.d_buf;

      frame = (struct canfd_frame *)priv->dev.d_buf;

      ninfo("CAN%" PRIu8 " FD ID: %" PRIu32 " len: %" PRIu8 "\n",
            config->port, (uint32_t)frame->can_id, frame->len);

      /* Extended or standard ID */

#ifdef CONFIG_NET_CAN_EXTID
      if ((frame->can_id & CAN_EFF_FLAG) != 0)
        {
          DEBUGASSERT(frame->can_id < (1 << 29));

          txbuffer[0] |= BUFFER_R0_EXTID(frame->can_id) | BUFFER_R0_XTD;
        }
      else
#endif
        {
          DEBUGASSERT(frame->can_id < (1 << 11));

          txbuffer[0] |= BUFFER_R0_STDID(frame->can_id);
        }

      /* CANFD frame */

      txbuffer[1] |= BUFFER_R1_FDF;

      /* Set DLC */

      txbuffer[1] |= BUFFER_R1_DLC(g_len_to_can_dlc[frame->len]);

      /* Set flags */

      if ((frame->can_id & CAN_RTR_FLAG) != 0)
        {
          txbuffer[0] |= BUFFER_R0_RTR;
        }

      if ((frame->flags & CANFD_BRS) != 0)
        {
          txbuffer[1] |= BUFFER_R1_BRS;
        }

      if ((frame->flags & CANFD_ESI) != 0)
        {
          txbuffer[0] |= BUFFER_R0_ESI;
        }

      /* Followed by the amount of data corresponding to the DLC (T2..) */

      src    = frame->data;
      nbytes = frame->len;
    }
#endif

  dest   = (uint32_t *)&txbuffer[2];

  /* Writes must be word length */

  for (i = 0; i < nbytes; i += 4)
    {
      /* Little endian is assumed */

      wordbuffer = src[0] |
                  (src[1] << 8) |
                  (src[2] << 16) |
                  (src[3] << 24);
      src += 4;

      *dest++ = wordbuffer;
    }

  /* Enable transmit interrupts from the TX FIFOQ buffer by setting TC
   * interrupt bit in IR (also requires that the TC interrupt is enabled)
   */

  fdcan_putreg(priv, STM32_FDCAN_TXBTIE_OFFSET, (1 << ndx));

  /* And request to send the packet */

  fdcan_putreg(priv, STM32_FDCAN_TXBAR_OFFSET, (1 << ndx));

  return OK;
}

/****************************************************************************
 * Name: fdcan_txready
 *
 * Description:
 *   Return true if the FDCAN hardware can accept another TX message.
 *
 * Input Parameters:
 *   dev - An instance of the "upper half" can driver state structure.
 *
 * Returned Value:
 *   True if the FDCAN hardware is ready to accept another TX message.
 *
 ****************************************************************************/

static bool fdcan_txready(struct stm32_fdcan_s *priv)
{
  uint32_t regval  = 0;
  bool     notfull = false;

  /* Return the state of the TX FIFOQ.  Return TRUE if the TX FIFO/Queue is
   * not full.
   */

  regval  = fdcan_getreg(priv, STM32_FDCAN_TXFQS_OFFSET);
  notfull = ((regval & FDCAN_TXFQS_TFQF) == 0);

  return notfull;
}

/****************************************************************************
 * Name: fdcan_rx0interrupt_work
 *
 * Description:
 *   CAN RX FIFO 0 worker
 *
 ****************************************************************************/

static void fdcan_rx0interrupt_work(void *arg)
{
  struct stm32_fdcan_s        *priv   = (struct stm32_fdcan_s *)arg;
  const struct stm32_config_s *config = NULL;
  uint32_t                     regval = 0;
  unsigned int                 nelem  = 0;
  unsigned int                 ndx    = 0;

  DEBUGASSERT(priv);
  config = priv->config;
  DEBUGASSERT(config);

  /* Clear the RX FIFO0 new message interrupt */

  fdcan_putreg(priv, STM32_FDCAN_IR_OFFSET, FDCAN_INT_RF0N);

  regval = fdcan_getreg(priv, STM32_FDCAN_RXF0S_OFFSET);
  nelem  = (regval & FDCAN_RXFS_FFL_MASK) >> FDCAN_RXFS_FFL_SHIFT;
  if (nelem > 0)
    {
      /* Handle the newly received message in FIFO0 */

      ndx = (regval & FDCAN_RXFS_FGI_MASK) >> FDCAN_RXFS_FGI_SHIFT;

      if ((regval & FDCAN_RXFS_RFL) != 0)
        {
          nerr("ERROR: Message lost: %08" PRIx32 "\n", regval);
        }
      else
        {
          fdcan_receive(priv,
                        config->msgram.rxfifo0 +
                        (ndx * priv->config->rxfifo0esize),
                        priv->config->rxfifo0esize);

